SecurityIncident
| summarize arg_max(TimeGenerated,Title,Tactics=tostring(AdditionalData.tactics),Severity,Status,Classification,ClosedTime,CreatedTime,FirstModifiedTime) by IncidentNumber
| extend Tactics = case(Tactics == "[]", pack_array("Unknown"), Tactics)
| mv-expand todynamic(Tactics)
| extend OpenHours = (iif(isnull(ClosedTime), now(), ClosedTime) - CreatedTime)/1h
| extend TriageHours = (FirstModifiedTime - CreatedTime)/1h
| order by OpenHours